---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinitionRegistry.Dispose
source: html/b0313bea-c8f5-9177-aeb7-36d51f01165e.htm
---
# Autodesk.Revit.DB.FailureDefinitionRegistry.Dispose Method

Releases all resources used by the FailureDefinitionRegistry

## Syntax (C#)
```csharp
public void Dispose()
```